[
  {
    "id": "0",
    "parents": [],
    "commonName": "Golden Palm",
    "description": "A curved trunk, sometimes standing up to 6 metres in height. A single cluster of green palm leaves. The fruit resemble coconuts, but are surprisingly gold in colour."
  },
  {
    "id": "1",
    "parents": [],
    "commonName": "Giant Tree Fern",
    "description": "Despite its name, this variety of fern grows to a height of just 3 metres on average; tall for a fern but shorter than most trees in the native forest where it grows. It features fronds and hairy bark similar to most other common varieties of ferns."
  },
  {
    "id": "12d8250b-eb50-48ce-ad6a-e9ab58898e82",
    "parents": [
      "1",
      "0"
    ],
    "commonName": "Golden Fern",
    "description": "A medium-sized plant reaching heights up to 4.5 meters, combining features from both parent plants. It has fronds similar to a fern but with a golden hue, and a trunk that curves elegantly like a palm tree. The bark is smooth and slightly shiny. The fruit produced by this plant are small and golden in color, resembling miniature coconuts."
  },
  {
    "id": "bb3f4dc7-074d-4de9-8586-e73acef6d132",
    "parents": [
      "1",
      "12d8250b-eb50-48ce-ad6a-e9ab58898e82"
    ],
    "commonName": "Golden Tree Fern",
    "description": "The Golden Tree Fern is a majestic hybrid plant that grows to an impressive height of 5 meters, towering over typical ferns. It boasts fronds with a shimmering golden hue, reminiscent of the sun reflecting off the leaves, and a trunk that gracefully twists like a spiral staircase, providing a unique visual appeal. The bark is smooth to the touch and exudes a subtle golden sheen. Its fruit, resembling golden orbs, add a touch of magic to this enchanting botanical creation."
  },
  {
    "id": "a54a817a-d931-4065-a701-5144b61b8ea6",
    "parents": [
      "0",
      "1"
    ],
    "commonName": "Golden Fern Palm",
    "description": "A unique hybrid plant with a straight trunk that can reach heights of 4 metres. The leaves are a combination of palm leaves and fern fronds, creating a lush green canopy. The bark is smooth yet golden in color, and the fruit produced are a striking mix of gold and green, resembling small coconuts with a fern-like texture."
  },
  {
    "id": "73d6f028-3d5d-439a-9de3-43a14c89906e",
    "parents": [
      "12d8250b-eb50-48ce-ad6a-e9ab58898e82",
      "0"
    ],
    "commonName": "Golden Palm Fern",
    "description": "A majestic plant with a curved trunk that reaches heights of about 5 meters, combining characteristics from both parent plants. It features fronds resembling a fern but with a golden hue similar to the Golden Fern parent. The trunk curves elegantly like a palm tree and has smooth, slightly shiny bark. Its fruit are small and golden, resembling miniature coconuts like those of its parent plants."
  },
  {
    "id": "d400cb86-0128-4158-9498-07b8dd0cc568",
    "parents": [
      "a54a817a-d931-4065-a701-5144b61b8ea6",
      "bb3f4dc7-074d-4de9-8586-e73acef6d132"
    ],
    "commonName": "Golden Spiral Fern",
    "description": "The Golden Spiral Fern is a mesmerizing hybrid plant that thrives in a harmonious blend of its parent species. Its trunk spirals elegantly upwards, adorned with shimmering golden bark that catches the light like a beacon. The leaves are a striking mix of palm fronds and ferns, creating a lush canopy of green and gold that dances in the breeze. Its fruit, resembling small coconuts with a fern-like texture, glow with a radiant golden-green hue, adding an air of mystique to this botanical wonder."
  },
  {
    "id": "7677461c-56d2-4c61-add1-748188dac9be",
    "parents": [
      "73d6f028-3d5d-439a-9de3-43a14c89906e",
      "1"
    ],
    "commonName": "Golden Tree Fern",
    "description": "The Golden Tree Fern is a stunning hybrid plant that combines traits from both parent species. It grows to a height of around 4 meters, boasting fronds with a golden hue and hairy bark. The fronds are reminiscent of a fern but with a touch of the majestic grace of a palm tree. Its small, golden fruit resembles a unique blend of miniature coconuts and spores commonly found in ferns."
  },
  {
    "id": "e9b37d98-78b4-4d31-8854-ccbf35f24da9",
    "parents": [
      "bb3f4dc7-074d-4de9-8586-e73acef6d132",
      "d400cb86-0128-4158-9498-07b8dd0cc568"
    ],
    "commonName": "Golden Spiral Tree Fern",
    "description": "The Golden Spiral Tree Fern emerges as a magical fusion of its parent species, showcasing a blend of enchanting characteristics. This hybrid plant grows to a grand height of 6 meters, featuring a captivating trunk that spirals gracefully upwards, adorned with shimmering golden bark that glistens in the sunlight. Its fronds are a beautiful mix of golden hues, combining the palm fronds and intricate patterns of fern leaves in a lush canopy that sways elegantly in the breeze. The Golden Spiral Tree Fern bears fruit in the form of luminous orbs with a delicate fern-like texture, radiating a mesmerizing golden-green glow that adds an aura of mystique to this captivating botanical marvel."
  }
]