[
  {
    "id": "echeveria",
    "commonName": "Echeveria",
    "imageUrl": "/plants/echeveria.png",
    "properties": {
      "flowerColour": "Pink",
      "flowerColourRGB": "#FFC0CB",
      "petalCountRange": "6-8",
      "petalShape": "Star",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Obovate",
      "leafMarginDescription": "Entire",
      "heightInMetres": 0.2,
      "funFact": "Echeveria, a genus of succulents valued as ornamental plants, faces challenges in classification due to the shortage of specimens and molecular studies."
    },
    "description": "The Echeveria features pink star-shaped flowers with typically 6-8 petals per bloom. The leaves are green, obovate in shape, featuring a entire edge. It grows to approximately 0.2 meters in height."
  },
  {
    "id": "baobab",
    "commonName": "Baobab",
    "imageUrl": "/plants/baobab.png",
    "properties": {
      "flowerColour": "White",
      "flowerColourRGB": "#FFFFFF",
      "petalCountRange": "5",
      "petalShape": "Bell",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Palmate",
      "leafMarginDescription": "Lobed",
      "heightInMetres": 25,
      "funFact": "The baobab tree, known as the Tree of Life, can store hundreds of gallons of water in its trunk, making it a vital resource for both animals and humans during droughts."
    },
    "description": "The Baobab features white bell-shaped flowers with typically 5 petals per bloom. The leaves are green, palmate in shape, featuring a lobed edge. It grows to approximately 25 meters in height."
  },
  {
    "id": "palm",
    "commonName": "Palm",
    "imageUrl": "/plants/palm.png",
    "properties": {
      "flowerColour": "Yellow",
      "flowerColourRGB": "#FFFF00",
      "petalCountRange": "3-5",
      "petalShape": "Cup",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Pinnate",
      "leafMarginDescription": "Smooth",
      "heightInMetres": 15,
      "funFact": "The palm tree, often referred to as the prince of the vegetable kingdom, produces a variety of useful products including coconuts, palm oil, and dates."
    },
    "description": "The Palm features yellow cup-shaped flowers with typically 3-5 petals per bloom. The leaves are green, pinnate in shape, featuring a smooth edge. It grows to approximately 15 meters in height."
  },
  {
    "id": "bonsai",
    "commonName": "Bonsai",
    "imageUrl": "/plants/bonzai.png",
    "properties": {
      "flowerColour": "Varied",
      "flowerColourRGB": "#FFD700",
      "petalCountRange": "5",
      "petalShape": "Rounded",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Elliptical",
      "leafMarginDescription": "Serrated",
      "heightInMetres": 0.5,
      "funFact": "Bonsai trees, with their miniature stature and intricate designs, are a captivating blend of art and horticulture, embodying centuries of Japanese tradition and patience."
    },
    "description": "The Bonsai features varied rounded-shaped flowers with typically 5 petals per bloom. The leaves are green, elliptical in shape, featuring a serrated edge. It grows to approximately 0.5 meters in height."
  },
  {
    "id": "prunus-serrulata",
    "commonName": "Prunus Serrulata",
    "imageUrl": "/plants/prunus-serrulata.png",
    "properties": {
      "flowerColour": "Pink",
      "flowerColourRGB": "#FFC0CB",
      "petalCountRange": "5",
      "petalShape": "Rosette",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Lanceolate",
      "leafMarginDescription": "Serrated",
      "heightInMetres": 8,
      "funFact": "Prunus serrulata, commonly known as the Japanese cherry blossom or sakura, paints landscapes with ethereal beauty during springtime, symbolizing renewal, fleeting beauty, and the transient nature of life in Japanese culture."
    },
    "description": "The Prunus serrulata features pink rosette-shaped flowers with typically 5 petals per bloom. The leaves are green, lanceolate in shape, featuring a serrated edge. It grows to approximately 8 meters in height."
  },
  {
    "id": "rose",
    "commonName": "Rose",
    "imageUrl": "/plants/rose.png",
    "properties": {
      "flowerColour": "Red",
      "flowerColourRGB": "#FF0000",
      "petalCountRange": "30-50",
      "petalShape": "Rounded",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Oval",
      "leafMarginDescription": "Serrated",
      "heightInMetres": 1.5,
      "funFact": "Renowned gardener Tom Carruth, through his work as a hybridizer, inadvertently found himself creating a plethora of celebrity roses, like Barbra Streisand's fragrant pink bloom and Marilyn Monroe's platinum blond variety, by combining different rose breeds. This process, spanning over a decade from cross-breeding to final introduction, often led to collaborations with stars, honoring their legacies and leveraging their names for marketing purposes within the floral industry, highlighting a unique convergence of Hollywood glamour and horticultural innovation."
    },
    "description": "The Rose features red rounded-shaped flowers with typically 30-50 petals per bloom. The leaves are green, oval in shape, featuring a serrated edge. It grows to approximately 1.5 meters in height."
  },
  {
    "id": "fir-tree",
    "commonName": "Fir Tree",
    "imageUrl": "/plants/fir-tree.png",
    "properties": {
      "flowerColour": "None",
      "flowerColourRGB": "#000000",
      "petalCountRange": "0",
      "petalShape": "None",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Needle",
      "leafMarginDescription": "Smooth",
      "heightInMetres": 30,
      "funFact": "The annual Rockefeller Center Christmas tree tradition, which began in 1931 amidst the Great Depression, features a majestic fir tree standing between West 48th and 51st street on Rockefeller Plaza, symbolizing hope and attracting millions of visitors each year, including a patriotic display post-9/11."
    },
    "description": "The Fir tree features none none-shaped flowers with typically 0 petals per bloom. The leaves are green, needle in shape, featuring a smooth edge. It grows to approximately 30 meters in height."
  },
  {
    "id": "fern",
    "commonName": "Fern",
    "imageUrl": "/plants/fern.png",
    "properties": {
      "flowerColour": "None",
      "flowerColourRGB": "#000000",
      "petalCountRange": "0",
      "petalShape": "None",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Frond",
      "leafMarginDescription": "Lobed",
      "heightInMetres": 1,
      "funFact": "Ferns, cherished for hundreds of millions of years, were a dietary staple for towering dinosaurs like the Diplodocus due to their abundance, nutritional value, and easy accessibility."
    },
    "description": "The Fern features none none-shaped flowers with typically 0 petals per bloom. The leaves are green, frond in shape, featuring a lobed edge. It grows to approximately 1 meters in height."
  },
  {
    "id": "liatris",
    "commonName": "Liatris",
    "imageUrl": "/plants/liatris.png",
    "properties": {
      "flowerColour": "Purple",
      "flowerColourRGB": "#800080",
      "petalCountRange": "Numerous",
      "petalShape": "Tubular",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Linear",
      "leafMarginDescription": "Entire",
      "heightInMetres": 1.2,
      "funFact": "Liatris, revered by Native Americans for centuries, holds a special place in traditional medicine, with various tribes using it to treat ailments ranging from respiratory issues to sore throats, showcasing its time-honored role as a healing herb in indigenous cultures."
    },
    "description": "The Liatris features purple tubular-shaped flowers with typically Numerous petals per bloom. The leaves are green, linear in shape, featuring a entire edge. It grows to approximately 1.2 meters in height."
  },
  {
    "id": "dandelion",
    "commonName": "Dandelion",
    "imageUrl": "/plants/dandelion.png",
    "properties": {
      "flowerColour": "Yellow",
      "flowerColourRGB": "#FFFF00",
      "petalCountRange": "Numerous",
      "petalShape": "Ligulate",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Runcinate",
      "leafMarginDescription": "Dentate",
      "heightInMetres": 0.3,
      "funFact": "Dandelions, once deemed pesky weeds, are now being cultivated for their rubber-producing properties by researchers like Katrina Cornish at Ohio State University. Their efforts, alongside companies like Bridgestone experimenting with plants like guayule, aim to offer a sustainable alternative to traditional sources of rubber, potentially revolutionizing the agricultural landscape and contributing to a more environmentally friendly future."
    },
    "description": "The Dandelion features yellow ligulate-shaped flowers with typically Numerous petals per bloom. The leaves are green, runcinate in shape, featuring a dentate edge. It grows to approximately 0.3 meters in height."
  },
  {
    "id": "water-lily",
    "commonName": "Water Lily",
    "imageUrl": "/plants/water-lily.png",
    "properties": {
      "flowerColour": "White",
      "flowerColourRGB": "#FFFFFF",
      "petalCountRange": "20-40",
      "petalShape": "Elliptical",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Orbicular",
      "leafMarginDescription": "Entire",
      "heightInMetres": 0.5,
      "funFact": "Did you know that Claude Monet, the iconic Impressionist artist, created a staggering 250 different paintings of water lilies throughout his career? These paintings, ranging from small canvases to monumental murals, showcase Monet's enduring fascination with capturing the ethereal beauty of these aquatic blooms. His obsession with water lilies not only transformed his artistic style but also left an indelible mark on the art world, inspiring generations of artists to explore the natural world through their own unique lenses."
    },
    "description": "The Water lily features white elliptical-shaped flowers with typically 20-40 petals per bloom. The leaves are green, orbicular in shape, featuring a entire edge. It grows to approximately 0.5 meters in height."
  },
  {
    "id": "aloe-vera",
    "commonName": "Aloe Vera",
    "imageUrl": "/plants/aloe-vera.png",
    "properties": {
      "flowerColour": "Yellow",
      "flowerColourRGB": "#FFFF00",
      "petalCountRange": "6-12",
      "petalShape": "Tubular",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Lanceolate",
      "leafMarginDescription": "Spiny",
      "heightInMetres": 0.6,
      "funFact": "Scientists have discovered that aloe vera plants have the remarkable ability to be transformed into supercapacitors, which are devices that store energy and discharge it rapidly, much like batteries. Researchers at the Beijing Institute of Technology in China have developed these supercapacitors using various parts of the aloe vera plant, with just a single gold wire as an additional material. These living supercapacitors can be integrated into plants themselves, allowing them to power lights or charge low-power devices—an innovative fusion of biology and technology!"
    },
    "description": "The Aloe vera features yellow tubular-shaped flowers with typically 6-12 petals per bloom. The leaves are green, lanceolate in shape, featuring a spiny edge. It grows to approximately 0.6 meters in height."
  },
  {
    "id": "mangrove",
    "commonName": "Mangrove",
    "imageUrl": "/plants/mangrove.png",
    "properties": {
      "flowerColour": "White",
      "flowerColourRGB": "#FFFFFF",
      "petalCountRange": "4-6",
      "petalShape": "Star",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Elliptical",
      "leafMarginDescription": "Entire",
      "heightInMetres": 3,
      "funFact": "Half of the world's mangrove forests, including those in southern India, Sri Lanka, and the Maldives, are at risk due to human activities, according to the International Union for Conservation of Nature (IUCN). Angela Andrade, chair of the IUCN commission on ecosystem management, emphasizes the critical role these ecosystems play in carbon storage and biodiversity."
    },
    "description": "The Mangrove features white star-shaped flowers with typically 4-6 petals per bloom. The leaves are green, elliptical in shape, featuring a entire edge. It grows to approximately 3 meters in height."
  },
  {
    "id": "sunflower",
    "commonName": "Sunflower",
    "imageUrl": "/plants/sunflower.png",
    "properties": {
      "flowerColour": "Yellow",
      "flowerColourRGB": "#FFFF00",
      "petalCountRange": "Numerous",
      "petalShape": "Ligulate",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Heart",
      "leafMarginDescription": "Serrated",
      "heightInMetres": 2,
      "funFact": "The sunflower, a symbol of solidarity with Ukraine, adorns figures like US First Lady Jill Biden and actress Caitriona Balfe. Biden wears sunflowers on her attire, Balfe carries one at events. This emblem, Ukraine's national flower, gained traction after a viral video urging Russian soldiers to carry sunflower seeds, symbolizing resistance."
    },
    "description": "The Sunflower features yellow ligulate-shaped flowers with typically Numerous petals per bloom. The leaves are green, heart in shape, featuring a serrated edge. It grows to approximately 2 meters in height."
  },
  {
    "id": "passion-flower",
    "commonName": "Passion Flower",
    "imageUrl": "/plants/passion-flower.png",
    "properties": {
      "flowerColour": "Purple",
      "flowerColourRGB": "#800080",
      "petalCountRange": "5-10",
      "petalShape": "Radial",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Palmate",
      "leafMarginDescription": "Lobed",
      "heightInMetres": 3,
      "funFact": "According to folklore, passionflower got its name because its corona resembles the crown of thorns worn by Jesus during the crucifixion. "
    },
    "description": "The Passion flower features purple radial-shaped flowers with typically 5-10 petals per bloom. The leaves are green, palmate in shape, featuring a lobed edge. It grows to approximately 3 meters in height."
  },
  {
    "id": "violette",
    "commonName": "Violette",
    "imageUrl": "/plants/violette.png",
    "properties": {
      "flowerColour": "Violet",
      "flowerColourRGB": "#EE82EE",
      "petalCountRange": "5",
      "petalShape": "Heart",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Cordate",
      "leafMarginDescription": "Crenate",
      "heightInMetres": 0.1,
      "funFact": "A chance discovery by bushwalker Juliette Gaynor-Brown in Tasmania's Ben Lomond National Park revealed the presence of a rare native violet previously unrecorded in the state. Identified as the dwarf violet, Viola improcera, experts confirmed its endangered status and extended range. The find underscores the importance of citizen science in conservation efforts."
    },
    "description": "The Violette features violet heart-shaped flowers with typically 5 petals per bloom. The leaves are green, cordate in shape, featuring a crenate edge. It grows to approximately 0.1 meters in height."
  },
  {
    "id": "pansy",
    "commonName": "Pansy",
    "imageUrl": "/plants/pansy.png",
    "properties": {
      "flowerColour": "Multicolor",
      "flowerColourRGB": "#FFD700",
      "petalCountRange": "5",
      "petalShape": "Rounded",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Oblong",
      "leafMarginDescription": "Crenate",
      "heightInMetres": 0.2,
      "funFact": "In Paris, the field pansy, Viola arvensis, has shown signs of rapid evolution, producing less nectar and smaller flowers, possibly due to decreasing insect pollinators. Evidence suggests it's self-pollinating, challenging conventional plant-insect pollination dynamics. This phenomenon underscores the complex impacts of environmental changes on plant-pollinator interactions and urges further study."
    },
    "description": "The Pansy features multicolor rounded-shaped flowers with typically 5 petals per bloom. The leaves are green, oblong in shape, featuring a crenate edge. It grows to approximately 0.2 meters in height."
  },
  {
    "id": "hibiscus",
    "commonName": "Hibiscus",
    "imageUrl": "/plants/hibiscus.png",
    "properties": {
      "flowerColour": "Red",
      "flowerColourRGB": "#FF0000",
      "petalCountRange": "5",
      "petalShape": "Trumpet",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Elliptical",
      "leafMarginDescription": "Serrated",
      "heightInMetres": 2.5,
      "funFact": "Hibiscus Island, nestled in the vibrant waters of Miami Beach, derives its name from the enchanting hibiscus flower. Completed in 1922 through dredging by the Army Corps of Engineers, this island has a rich history tied to the development of Miami Beach. It became a seasonal winter home for celebrities like Al Capone in the 1930s and later hosted the renowned Latin Quarter Nightclub in the 1940s and 50s, attracting stars like Frank Sinatra and Sammy Davis Jr."
    },
    "description": "The Hibiscus features red trumpet-shaped flowers with typically 5 petals per bloom. The leaves are green, elliptical in shape, featuring a serrated edge. It grows to approximately 2.5 meters in height."
  },
  {
    "id": "morning-glory",
    "commonName": "Morning Glory",
    "imageUrl": "/plants/morning-glory.png",
    "properties": {
      "flowerColour": "Blue",
      "flowerColourRGB": "#0000FF",
      "petalCountRange": "5",
      "petalShape": "Trumpet",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Heart",
      "leafMarginDescription": "Entire",
      "heightInMetres": 3,
      "funFact": "The term morning glory has blossomed into various meanings since the 1800s. Initially describing a flower that blooms in the morning, it later referred to underperforming athletes, drug users, and even described morning erections. In the 1990s, Oasis's album (What’s the Story) Morning Glory? and a 2010 film starring Rachel McAdams renewed interest in the term. In 2018, a men's health startup released an erection-tracking app named Morning Glory, garnering media attention."
    },
    "description": "The Morning glory features blue trumpet-shaped flowers with typically 5 petals per bloom. The leaves are green, heart in shape, featuring a entire edge. It grows to approximately 3 meters in height."
  },
  {
    "id": "oak",
    "commonName": "Oak",
    "imageUrl": "/plants/oak.png",
    "properties": {
      "flowerColour": "None",
      "flowerColourRGB": "#000000",
      "petalCountRange": "0",
      "petalShape": "None",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Lobed",
      "leafMarginDescription": "Lobed",
      "heightInMetres": 30,
      "funFact": "The iconic spire of Notre Dame Cathedral in Paris, destroyed in a fire in 2019, is set to be rebuilt using oak trees sourced from the historic Forest of Bercé in France. These majestic oaks, aged over two hundred years old, will undergo precise measurements before becoming part of the cathedral's reconstruction, a process described as a historic moment by those involved."
    },
    "description": "The Oak features none none-shaped flowers with typically 0 petals per bloom. The leaves are green, lobed in shape, featuring a lobed edge. It grows to approximately 30 meters in height."
  },
  {
    "id": "euphorbia-obesa",
    "commonName": "Euphorbia Obesa",
    "imageUrl": "/plants/euphorbia-obesa.png",
    "properties": {
      "flowerColour": "Yellow",
      "flowerColourRGB": "#FFFF00",
      "petalCountRange": "Small",
      "petalShape": "Star",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "None",
      "leafMarginDescription": "None",
      "heightInMetres": 0.3,
      "funFact": "The Euphorbia obesa, also known as the baseball plant due to its striking resemblance to a baseball, is a rare and unique succulent native to South Africa. Despite its appearance, this plant is not actually a cactus but belongs to the Euphorbiaceae family. Its spherical shape and intriguing patterns make it a favorite among succulent enthusiasts worldwide."
    },
    "description": "The Euphorbia obesa features yellow star-shaped flowers with typically Small petals per bloom. The leaves are green, none in shape, featuring a none edge. It grows to approximately 0.3 meters in height."
  },
  {
    "id": "calliandra-haematocephala",
    "commonName": "Calliandra Haematocephala",
    "imageUrl": "/plants/calliandra-haematocephala.png",
    "properties": {
      "flowerColour": "Red",
      "flowerColourRGB": "#FF0000",
      "petalCountRange": "Numerous",
      "petalShape": "Brush",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Bipinnate",
      "leafMarginDescription": "Entire",
      "heightInMetres": 3,
      "funFact": "Calliandra haematocephala, also known as the Common Powder Puff plant, is a versatile addition to permaculture gardens. This fast-growing legume serves multiple purposes, including providing valuable mulch, shade, and fodder for livestock. It is also utilized in land rehabilitation efforts and supports honey production by attracting pollinators. With its hardy nature and numerous benefits, Calliandra haematocephala is a valuable asset in sustainable gardening practices."
    },
    "description": "The Calliandra haematocephala features red brush-shaped flowers with typically Numerous petals per bloom. The leaves are green, bipinnate in shape, featuring a entire edge. It grows to approximately 3 meters in height."
  },
  {
    "id": "garrya-elliptica",
    "commonName": "Garrya Elliptica",
    "imageUrl": "/plants/garrya-elliptica.png",
    "properties": {
      "flowerColour": "Gray",
      "flowerColourRGB": "#808080",
      "petalCountRange": "Small",
      "petalShape": "Catkin",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Elliptical",
      "leafMarginDescription": "Wavy",
      "heightInMetres": 4,
      "funFact": "Garrya elliptica, also known as the Silk Tassel Bush, not only adds aesthetic charm to gardens with its distinctive catkins but also provides essential habitat and food for wildlife, making it a valuable asset to ecosystems."
    },
    "description": "The Garrya elliptica features gray catkin-shaped flowers with typically Small petals per bloom. The leaves are green, elliptical in shape, featuring a wavy edge. It grows to approximately 4 meters in height."
  },
  {
    "id": "tulipe",
    "commonName": "Tulipe",
    "imageUrl": "/plants/tulipe.png",
    "properties": {
      "flowerColour": "Various",
      "flowerColourRGB": "#FF6347",
      "petalCountRange": "6",
      "petalShape": "Cup",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Lanceolate",
      "leafMarginDescription": "Entire",
      "heightInMetres": 0.6,
      "funFact": "The Semper Augustus tulip bulb, which fetched a staggering 10,000 guilders in January 1637, was valued at the price of the finest house on Amsterdam's most fashionable canal, making it the most expensive tulip bulb in history."
    },
    "description": "The Tulipe features various cup-shaped flowers with typically 6 petals per bloom. The leaves are green, lanceolate in shape, featuring a entire edge. It grows to approximately 0.6 meters in height."
  },
  {
    "id": "moss",
    "commonName": "Moss",
    "imageUrl": "/plants/moss.png",
    "properties": {
      "flowerColour": "None",
      "flowerColourRGB": "None",
      "petalCountRange": "None",
      "petalShape": "None",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "None",
      "leafMarginDescription": "None",
      "heightInMetres": 0.05,
      "funFact": "Moss has inspired a wellness trend called girl mossing, where people unwind in nature, embracing the slow pace and tranquility it offers."
    },
    "description": "The Moss features none none-shaped flowers with typically None petals per bloom. The leaves are green, none in shape, featuring a none edge. It grows to approximately 0.05 meters in height."
  },
  {
    "id": "thistle",
    "commonName": "Thistle",
    "imageUrl": "/plants/thistle.png",
    "properties": {
      "flowerColour": "Purple",
      "flowerColourRGB": "#800080",
      "petalCountRange": "Numerous",
      "petalShape": "Spiny",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Oblong",
      "leafMarginDescription": "Spiny",
      "heightInMetres": 1,
      "funFact": "The thistle Carlina corymbosa, found in the Sierra de Cazorla mountain range in southern Spain, exhibits a fascinating ability to remain cooler than the surrounding air, making its flowers a refreshing touch on scorching summer days, as reported in Ecology by ecologist Carlos Herrera."
    },
    "description": "The Thistle features purple spiny-shaped flowers with typically Numerous petals per bloom. The leaves are green, oblong in shape, featuring a spiny edge. It grows to approximately 1 meters in height."
  },
  {
    "id": "cypresstree",
    "commonName": "Cypress Tree",
    "imageUrl": "/plants/cypress.png",
    "properties": {
      "flowerColour": "None",
      "flowerColourRGB": "#000000",
      "petalCountRange": "0",
      "petalShape": "None",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Scale-like",
      "leafMarginDescription": "Entire",
      "heightInMetres": 20,
      "funFact": "The Cypress of Abarkuh in Iran holds the title of the oldest living cypress tree in the world, boasting over 4,000 years of history."
    },
    "description": "The Cypress tree features none none-shaped flowers with typically 0 petals per bloom. The leaves are green, scale-like in shape, featuring a entire edge. It grows to approximately 20 meters in height."
  },
  {
    "id": "fly-agaric",
    "commonName": "Fly Agaric",
    "imageUrl": "/plants/fly-agaric.png",
    "properties": {
      "flowerColour": "Red",
      "flowerColourRGB": "#FF0000",
      "petalCountRange": "None",
      "petalShape": "None",
      "leafColour": "None",
      "leafColourRGB": "#000000",
      "leafShape": "None",
      "leafMarginDescription": "None",
      "heightInMetres": 0.2,
      "funFact": "In the fantasy novel Alice in Wonderland, there is a magic mushroom that can make Alice change in size, its magical properties said to have been inspired by the hallucinogenic effect of the fly agaric mushroom."
    },
    "description": "The Fly agaric features red none-shaped flowers with typically None petals per bloom. The leaves are none, none in shape, featuring a none edge. It grows to approximately 0.2 meters in height."
  },
  {
    "id": "olive-tree",
    "commonName": "Olive Tree",
    "imageUrl": "/plants/olive-tree.png",
    "properties": {
      "flowerColour": "White",
      "flowerColourRGB": "#FFFFFF",
      "petalCountRange": "4",
      "petalShape": "Star",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Elliptical",
      "leafMarginDescription": "Entire",
      "heightInMetres": 6,
      "funFact": "The olive tree stands as a symbol of Palestinian identity and resilience, with its cultivation forming a vital aspect of the Palestinian economy, despite being targeted in the ongoing Israeli-Palestinian conflict."
    },
    "description": "The Olive tree features white star-shaped flowers with typically 4 petals per bloom. The leaves are green, elliptical in shape, featuring a entire edge. It grows to approximately 6 meters in height."
  },
  {
    "id": "lily-of-the-valley",
    "commonName": "Lily of the Valley",
    "imageUrl": "/plants/lily-of-the-valley.png",
    "properties": {
      "flowerColour": "White",
      "flowerColourRGB": "#FFFFFF",
      "petalCountRange": "6",
      "petalShape": "Bell",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Elliptical",
      "leafMarginDescription": "Entire",
      "heightInMetres": 0.3,
      "funFact": "In France, lily of the valley flowers, known as 'muguet', are traditionally exchanged on May 1st to symbolize luck and good wishes, dating back to a tradition initiated by King Charles IX in 1561."
    },
    "description": "The Lily of the valley features white bell-shaped flowers with typically 6 petals per bloom. The leaves are green, elliptical in shape, featuring a entire edge. It grows to approximately 0.3 meters in height."
  },
  {
    "id": "bamboo",
    "commonName": "Bamboo",
    "imageUrl": "/plants/bamboo.png",
    "properties": {
      "flowerColour": "Rare",
      "flowerColourRGB": "#000000",
      "petalCountRange": "Unknown",
      "petalShape": "None",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Lanceolate",
      "leafMarginDescription": "Entire",
      "heightInMetres": 10,
      "funFact": "In the UK, certain varieties of bamboo, once planted as ornamental novelties, are now causing significant damage to homes and gardens, with some homeowners facing bills exceeding £100,000 for removal and repairs."
    },
    "description": "The Bamboo features rare none-shaped flowers with typically Unknown petals per bloom. The leaves are green, lanceolate in shape, featuring a entire edge. It grows to approximately 10 meters in height."
  },
  {
    "id": "monstera-deliciosa",
    "commonName": "Monstera Deliciosa",
    "imageUrl": "/plants/monstera-deliciosa.png",
    "properties": {
      "flowerColour": "White",
      "flowerColourRGB": "#FFFFFF",
      "petalCountRange": "1-2",
      "petalShape": "Spathe",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Fenestrated",
      "leafMarginDescription": "Entire",
      "heightInMetres": 3,
      "funFact": "Karlie Kloss is among the celebrities who adore the Monstera deliciosa, known for its large tropical leaves and ability to grow up to 10 feet tall in optimal conditions, adding a lush jungle vibe to any room with its bright, indirect light and consistent watering requirements."
    },
    "description": "The Monstera deliciosa features white spathe-shaped flowers with typically 1-2 petals per bloom. The leaves are green, fenestrated in shape, featuring a entire edge. It grows to approximately 3 meters in height."
  },
  {
    "id": "acacia",
    "commonName": "Acacia",
    "imageUrl": "/plants/acacia.png",
    "properties": {
      "flowerColour": "Yellow",
      "flowerColourRGB": "#FFFF00",
      "petalCountRange": "5",
      "petalShape": "Round",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Bipinnate",
      "leafMarginDescription": "Entire",
      "heightInMetres": 8,
      "funFact": "The rapid expansion of acacia plantations in Central Vietnam, driven by the demand for wood pellets, has led to severe environmental consequences, including deforestation, biodiversity loss, and the heightened risk of landslides, underscoring the complex trade-offs between economic development and environmental sustainability."
    },
    "description": "The Acacia features yellow round-shaped flowers with typically 5 petals per bloom. The leaves are green, bipinnate in shape, featuring a entire edge. It grows to approximately 8 meters in height."
  },
  {
    "id": "venus-flytrap",
    "commonName": "Venus Flytrap",
    "imageUrl": "/plants/venus-flytrap.png",
    "properties": {
      "flowerColour": "White",
      "flowerColourRGB": "#FFFFFF",
      "petalCountRange": "5-6",
      "petalShape": "Star",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Obovate",
      "leafMarginDescription": "Ciliate",
      "heightInMetres": 0.15,
      "funFact": "In a groundbreaking study published in Current Biology, scientists utilized CRISPR-Cas9 technology for the first time in a carnivorous plant, the Venus flytrap, to demonstrate the crucial role of two ion channels in triggering the closure of the trap when prey brushes against its trigger hairs, shedding light on the long-standing mystery of how this plant captures its prey."
    },
    "description": "The Venus flytrap features white star-shaped flowers with typically 5-6 petals per bloom. The leaves are green, obovate in shape, featuring a ciliate edge. It grows to approximately 0.15 meters in height."
  },
  {
    "id": "prickly-pear",
    "commonName": "Prickly Pear",
    "imageUrl": "/plants/prickly-pear.png",
    "properties": {
      "flowerColour": "Yellow",
      "flowerColourRGB": "#FFFF00",
      "petalCountRange": "8-10",
      "petalShape": "Rounded",
      "leafColour": "Green",
      "leafColourRGB": "#008000",
      "leafShape": "Oblong",
      "leafMarginDescription": "Spiny",
      "heightInMetres": 1.5,
      "funFact": "Prickly pear, once considered one of the greatest biological invasions in Australia, infesting millions of hectares of rural land, was conquered thanks to the introduction of the Cactoblastis cactorum moth from South America, which caused the collapse of most of the thick stands of prickly pear within a few years, leading to the revitalization of stagnant townships and the restoration of previously infested land for agricultural use."
    },
    "description": "The Prickly pear features yellow rounded-shaped flowers with typically 8-10 petals per bloom. The leaves are green, oblong in shape, featuring a spiny edge. It grows to approximately 1.5 meters in height."
  }
]
